#
# Copyright (C) 2021-2022 by TeamYukki@Github, < https://github.com/TeamYukki >.
#
# This file is part of < https://github.com/TeamYukki/YukkiMusicBot > project,
# and is released under the "GNU v3.0 License Agreement".
# Please see < https://github.com/TeamYukki/YukkiMusicBot/blob/master/LICENSE >
#
# All rights reserved.

HELP_1 = """✅**<u>اوامر الادمن:</u>**
**c** رمز التحكم في القنوات
يمكنك كتابه الامر بدون شرط
      ♡•━• 𝗦𝗢𝗨𝗥𝗖𝗘 𝗭𝗘𝗥𝗢 •━•♡
◍ /pause or /cpause - **وقف** √ للوقف مؤقتا√.
◍ /resume or /cresume- **كمل** √ لاستئناف التشغيل√.
◍ /mute or /cmute- **اسكت** √ لكتم البوت√.
◍ /unmute or /cunmute- **اتكلم** √ لألغاء الكتم.
◍ /skip or /cskip- **تخطي** √ لتقدم للمسار التالي√.
◍ /stop or /cstop- **ايقاف** √ لانهاء التشغيل√.
◍ /shuffle or /cshuffle- عشوئى √ لتشغيل قوئم الانتظار عشوئى√.
◍ /seek or /cseek - العوده لقايمه التشغيل√
◍ /seekback or /cseekback - العوده للمشغل
◍ /restart - تحديث √ لتحديث قايمه الادمنيه√ .
      ♡•━• 𝗦𝗢𝗨𝗥𝗖𝗘 𝗭𝗘𝗥𝗢 •━•♡."""


HELP_2 = """✅<u>**اوامرالتشغيل:**</u>
🖥اوامر تشغيل البوت في الجروبات والقنوات\nالامر يكتب كما هو لا تستخدم شرط او رموز قبله
      ♡•━• 𝗦𝗢𝗨𝗥𝗖𝗘 𝗭𝗘𝗥𝗢 •━•♡
◍ اوامر تشغيل البوت في المجموعات √
◍ 『**تشغيل**』➢➕\n「اسم الأغنية او رابط تشغيل」
◍ 『**vplay**』➢➕\n「اسم الفديو او / رابط الفيديو」 تشغيل الفيديو داخل المكالمة  
◍ 『**تحميل**』➢➕\n«اسم الاغنيه»لتحميل اغنيه من اليوتيوب
◍ 『تحديث』➢لتحديث قائمه الادمنيه
      ♡•━• 𝗦𝗢𝗨𝗥𝗖𝗘 𝗭𝗘𝗥𝗢 •━•♡
جزء القنوات اضف البوت \nفي جروبك وقناتك مشرف
ثم تكتب في جروبك 
**ربط** + يوزر القناه او الايدي \nثم ثكتب الاوامر الاتيه في الجروب 
◍ 『**cplay**』➢ +\n اسم الاغنيه لتشغيل اغاني في قناتك 
◍ 『**cvplay**』➢ +\nاسم الاغنيه لتشغيل فديو في قناتك
      ♡•━• 𝗦𝗢𝗨𝗥𝗖𝗘 𝗭𝗘𝗥𝗢 •━•♡."""


HELP_3 = """✅<u>**اوامر البوت:**</u>
يمكن استخدام الاوامر بدون شرط
      ♡•━• 𝗦𝗢𝗨𝗥𝗖𝗘 𝗭𝗘𝗥𝗢 •━•♡
◍ /stats - **احصا** √ لعرض الاحصائيات.
◍ /sudolist - **الادمنيه** √ لعرض الادمنيه البوت
◍ /lyrics [Music Name] - **كلمات** √ لعرض كلمات اغنيه√.
/song [Track Name] or رابط -**تحميل** لتحميل من اليوتيوب.
◍ /player - **النشغل** √ لعرض قايمه التشغيل√.
◍ **c** هذا الرمز للقنوات فقط √. 
◍ /queue or /cqueue- لعرض قايمه التشغيل√
      ♡•━• 𝗦𝗢𝗨𝗥𝗖𝗘 𝗭𝗘𝗥𝗢 •━•♡"""

HELP_4 = """✅<u>**Extra  Commands:**</u>
/start - Start the Music Bot.
/help  - Get Commands Helper Menu with detailed explanations of commands.
/ping- Ping the Bot and check Ram, Cpu etc stats of Bot.
✅<u>**Group Settings:**</u>
/settings - Get a complete group's settings with inline buttons
🔗 **Options in Settings:**
1️⃣ You can set **Audio Quality** you want to stream on voice chat.
2️⃣ You can set **Video Quality** you want to stream on voice chat.
3️⃣ **Auth Users**:- You can change admin commands mode from here to everyone or admins only. If everyone, anyone present in you group will be able to use admin commands(like /skip, /stop etc)
4️⃣ **Clean Mode:** When enabled deletes the bot's messages after 5 mins from your group to make sure your chat remains clean and good.
5️⃣ **Command Clean** : When activated, Bot will delete its executed commands (/play, /pause, /shuffle, /stop etc) immediately.
6️⃣ **Play Settings:**
/playmode - Get a complete play settings panel with buttons where you can set your group's play settings. 
<u>Options in playmode:</u>
1️⃣ **Search Mode** [Direct or Inline] - Changes your search mode while you give /play mode. 
2️⃣ **Admin Commands** [Everyone or Admins] - If everyone, anyone present in you group will be able to use admin commands(like /skip, /stop etc)
3️⃣ **Play Type** [Everyone or Admins] - If admins, only admins present in group can play music on voice chat."""

HELP_5 = """🔰**<u>ADD & REMOVE SUDO USERS :</u>**
/ addudo [اسم المستخدم أو الرد على مستخدم]
/ delsudo [اسم المستخدم أو الرد على مستخدم]
🛃 ** <u> HEROKU: </u> **
/ الاستخدام - Dyno Usage.
🌐 ** <u> متغيرات التكوين: </ u> **
/ get_var - احصل على var config من Heroku أو .env.
/ del_var - احذف أي var على Heroku أو .env.
/ set_var [Var Name] [القيمة] - قم بتعيين Var أو قم بتحديث Var على heroku أو .env. منفصلة Var وقيمتها مع مسافة.
🤖 ** <u> أوامر البوت: </ u> **
/ reboot - أعد تشغيل الروبوت الخاص بك.
/ تحديث - تحديث البوت.
/ speedtest - تحقق من سرعات الخادم
/ صيانة [تمكين / تعطيل]
/ المسجل [تمكين / تعطيل] - يقوم البوت بتسجيل الاستعلامات التي تم البحث عنها في مجموعة المسجل.
/ get_log [Number of Lines] - احصل على سجل للروبوت الخاص بك من heroku أو vps. يعمل لكليهما.
/ autoend [تمكين | تعطيل] - تمكين إنهاء البث التلقائي بعد 3 دقائق إذا لم يكن هناك من يستمع.
📈 ** <u> أوامر STATS: </u> **
/ activevoice - تحقق من الدردشات الصوتية النشطة على الروبوت.
/ activevideo - تحقق من مكالمات الفيديو النشطة على الروبوت.
/ stats - تحقق من إحصائيات الروبوتات
⚠️ ** <u> وظيفة الدردشة في القائمة السوداء: </ u> **
/ blacklistchat [CHAT_ID] - قم بإدراج أي دردشة في القائمة السوداء من استخدام Music Bot
/ whitelistchat [CHAT_ID] - أضف أي دردشة بالقائمة السوداء إلى القائمة البيضاء من استخدام Music Bot
/ blacklistedchat - تحقق من جميع الدردشات المدرجة في القائمة السوداء.
👤 ** <u> وظيفة محظورة: </ u> **
/ block [اسم المستخدم أو الرد على مستخدم] - يمنع المستخدم من استخدام أوامر الروبوت.
/ إلغاء حظر [اسم المستخدم أو الرد على مستخدم] - إزالة مستخدم من قائمة بوت المحظورة.
/ blockusers - تحقق من قوائم المستخدمين المحظورة
👤 ** <u> وظيفة GBAN: </u> **
/ gban [اسم المستخدم أو الرد على مستخدم] - Gban مستخدمًا من الدردشة التي يقدمها الروبوت وأوقفه عن استخدام برنامج الروبوت الخاص بك.
/ ungban [اسم المستخدم أو الرد على مستخدم] - أزل مستخدمًا من قائمة gbanned في Bot واسمح له باستخدام برنامج الروبوت الخاص بك
/ gbannedusers - تحقق من قوائم المستخدمين Gbanned
🎥 ** <u> وظيفة مكالمات الفيديو: </ u> **
/ set_video_limit [عدد الدردشات] - تعيين الحد الأقصى لعدد الدردشات المسموح بها لمكالمات الفيديو في كل مرة. افتراضي إلى 3 محادثات.
/ videomode [تنزيل | m3u8] - إذا تم تمكين وضع التنزيل ، فسيقوم الروبوت بتنزيل مقاطع الفيديو بدلاً من تشغيلها في شكل M3u8. افتراضيا إلى M3u8. يمكنك استخدام وضع التنزيل عندما لا يتم تشغيل أي استعلام في وضع m3u8.
⚡️ ** <u> وظيفة البوت الخاص: </ u> **
/ يأذن [CHAT_ID] - اسمح بالمحادثة لاستخدام الروبوت الخاص بك.
/ unauthorize [CHAT_ID] - امنع الدردشة من استخدام الروبوت الخاص بك.
/ مخول - تحقق من جميع الدردشات المسموح بها في برنامج الروبوت الخاص بك.
🌐 ** <u> وظيفة البث: </ u> **
/ بث [رسالة أو رد على رسالة] - بث أي رسالة إلى الدردشات التي يقدمها برنامج الروبوت.
خيارات <u> للبث: </ u>
** - pin **: سيؤدي هذا إلى تثبيت رسالتك
** - pinloud **: سيؤدي هذا إلى تثبيت رسالتك بإشعار عالٍ
** - user **: سيؤدي هذا إلى بث رسالتك للمستخدمين الذين بدأوا برنامج الروبوت الخاص بك.
** - المساعد **: سيؤدي هذا إلى بث رسالتك من حساب المساعد الخاص بالروبوت الخاص بك.
** - nobot **: هذا سيجبر الروبوت الخاص بك على عدم بث الرسالة
** مثال: ** `/ بث-مستخدم-مساعدة-اختبار مرحبًا`
"""
